import React, { useEffect, useState } from "react";
import './promo.css';

function Promo() {

  return (
    <section className="aboutMe__button-content" id="Promo">
      <div className='aboutMe__column'>
        <p className="aboutMe__text">
          1. Немного конкретики, наконец. Женечка прошла курс по обучению на веб-разработчика от Яндекс.Практикума (январь 2023) и курс по react-разработке там же (май 2023). Пауза вызвана тем, что Женечку снова захантили в офигенные документоведы.
        </p>
        <p className="aboutMe__text">
          2. Сейчас Женечка ковыряет учебники Трепачева, читает про UX/UI в феминистической читальне, перепрохожит обновленный курс frontend-разработки у Яндекса и грызет чертовы алгоритмы в html-academy, а еще перечитывает всю теорию на свете, чтобы смотреться на собеседовании убедительно. Пока Женечка перечитала не все и стремается по этому поводу, есть шанс нанять ее за ветку.
        </p>
        <p className="aboutMe__text">
          3. Параллельно Женечка пишет несколько пет-проектов, на которых учится взаимодействию с командой: ПМ может не отличать фронта от дизайнера после двух месяцев работы, заказчик сайта-визитки может хотеть формат интернет-магазина без наполнения для интернет-магазина, редкий проект доползает до MVP. Созвоны, общие репозитории - словом, полное погружение.
        </p>
        <p className="aboutMe__text">
          4. То есть Женечка - уже не просто вкатышек после курсов. Она вкатышек++
        </p>
        <p className="aboutMe__text">
          5. Женечка понимает, что ей еще пахать и пахать. Пока готова (и может себе позволить) работать за еду и код-ревью (читай, бесценный опыт), но это временно, потому что цели - гиперэкспертность, понимание происходящего, высокая скорость работы, приятная зарплата.
        </p>
        <p className="aboutMe__text">
          6. Всю сознательную жизнь Женечка работала за себя и за того парня и не видит, почему айтишка станет исключением. Когда Женечка уходила в декрет, на ее функционал взяли четверых, здорово снизив требования к результату. На предпоследнем месте Женечке менее чем за год выдали функционал двух ведущих инженеров со стажем 5-10 лет. На последнем ей выдали полную ставку вместо половины и иногда предлагают взять еще немножко.
        </p>
        <p className="aboutMe__text">
          7. У Женечки два бессмысленных высших образования (одно - с красным дипломом), и два специальных, то есть учится Женечка всю дорогу.
        </p>
        <p className="aboutMe__text">
          8. Женечка переучивалась без пауз и академов с ребенком на голове и насыщенной работой фуллтайм (и никого не убила, не развелась, даже ребенок не начал заикаться). Женечка способна осваивать новый фреймворк под звуки мультиков, с осьминогом на голове, одной рукой изображая паучка и отвечая на бытовые вопросы раз в три минусы. Может показаться, что Женечка или преувеличивает, или сверхчеловек (на деле где-то 30/70). Целеустремленностью Женечки можно резать некоторые сорта сыра.
        </p>
        <p className="aboutMe__text">
          9. Женечка идет по жизни, поигрывая софт-скиллами: школьные друзья Женечки недавно набили с ней общую тату, университетские зовут ее работать вместе, первый же парень Женечки женился на ней и никуда не девается уже 15+ лет. На последние две работы Женечку привели друзья и бывшие коллеги - и не пожалели об этом!
        </p>
        <p className="aboutMe__text">
          10. Практически на любую прежнюю работу Женечка может вернуться, и парочку последних коварно держит во френдзоне. На всех работах она успешно проходила испытательных срок; на двух ее взяли в штат из 30+ кандидатов, которые тоже были после испытательного срока (потом Женечку стали отрывать с руками безо всяких сроков, заметим в скобках). 
        </p>
        <p className="aboutMe__text">
          11. Помимо того, что Женечка - офигенный документовед и корректор официальных текстов, еще она кондитер четвертого разряда с развесистым портфолио. За отдельную доплату она НЕ БУДЕТ печь в офис.
        </p>
        <p className="aboutMe__text">
          12. Недостатки: начальники периодически не слышат ее стоп-слово. Но эту увлекательную историю она расскажет на собеседовании.
        </p>
      </div>
    </section>
  );
}  

export default Promo; 